In [11]:
from sqlalchemy import create_engine
import pandas as pd

In [14]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [15]:
try:
    connection = engine.connect()
    print("Connection to the database was successful!")
    connection.close()
except Exception as e:
    print(f"An error occurred: {e}")

Connection to the database was successful!

## Question 3. Trip Segmentation Count

During the period of October 1st 2019 (inclusive) and November 1st 2019 (exclusive), how many trips, respectively, happened:

1- Up to 1 mile

2- In between 1 (exclusive) and 3 miles (inclusive)

3- In between 3 (exclusive) and 7 miles (inclusive)

4- In between 7 (exclusive) and 10 miles (inclusive)

5- Over 10 miles

In [20]:
query = """
SELECT
    COUNT(CASE WHEN trip_distance <= 1 THEN 1 END) AS "up to 1 mile",
    COUNT(CASE WHEN trip_distance> 1 AND trip_distance <= 3 THEN 1 END) AS "between 1 and 3 miles",
    COUNT(CASE WHEN trip_distance > 3 AND trip_distance <= 7 THEN 1 END) AS "between 3 and 7 miles",
    COUNT(CASE WHEN trip_distance> 7 AND trip_distance <= 10 THEN 1 END) AS "between 7 and 10 miles",
    COUNT(CASE WHEN trip_distance > 10 THEN 1 END) AS "over 10 miles"
FROM green_tripdata
WHERE lpep_pickup_datetime >= '2019-10-01' AND lpep_pickup_datetime < '2019-11-01';
"""
pd.read_sql(query, con=engine)

,up to 1 mile,between 1 and 3 miles,between 3 and 7 miles,between 7 and 10 miles,over 10 miles
0,102152,194223,107772,27303,34908

## Question 4. Longest trip for each day
Which was the pick up day with the longest trip distance? Use the pick up time for your calculations.

In [24]:
query = """
WITH daily_longest_trip AS (
    SELECT
        DATE(lpep_pickup_datetime) AS pickup_day,
        MAX(trip_distance) AS longest_trip
    FROM green_tripdata
    GROUP BY DATE(lpep_pickup_datetime)
)
SELECT
    pickup_day
FROM daily_longest_trip
ORDER BY longest_trip DESC
LIMIT 1;
"""

pd.read_sql(query, con=engine)

   pickup_day
0  2019-10-31

## Question 5. Three biggest pickup zones
Which were the top pickup locations with over 13,000 in total_amount (across all trips) for 2019-10-18?

Consider only lpep_pickup_datetime when filtering by date

In [32]:
query = """
SELECT 
    "PULocationID" AS pickup_zone,
    SUM(total_amount) AS total_revenue
FROM green_tripdata
WHERE 
    DATE(lpep_pickup_datetime) = '2019-10-18'
GROUP BY "PULocationID"
HAVING SUM(total_amount) > 13000
ORDER BY total_revenue DESC
LIMIT 3
"""
pd.read_sql(query, con=engine)

   pickup_zone  total_revenue
0           74       18686.68
1           75       16797.26
2          166       13029.79

In [35]:
query = """
WITH partial AS ( 
    SELECT 
        "PULocationID" AS pickup_zone,
        SUM(total_amount) AS total_revenue
    FROM green_tripdata
    WHERE 
        DATE(lpep_pickup_datetime) = '2019-10-18'
    GROUP BY "PULocationID"
    HAVING SUM(total_amount) > 13000
    ORDER BY total_revenue DESC
    LIMIT 3
)
SELECT 
    p.pickup_zone,
    p.total_revenue,
    z."Zone"
FROM partial AS p
JOIN taxi_zone_lookup AS z
ON p.pickup_zone = z."LocationID"
WHERE z."LocationID" IN (74, 75, 166);	
"""

pd.read_sql(query, con=engine)

Empty DataFrame
Columns: [pickup_zone, total_revenue, Zone]
Index: []